Revit 2026 API

# TextBoxEnterPressedEventArgs Class

---

The event arguments used by TextBox's EnterPressed event.

SystemObject SystemEventArgs Autodesk.Revit.UI.EventsRibbonItemEventArgs Autodesk.Revit.UI.EventsTextBoxEnterPressedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TextBoxEnterPressedEventArgs : RibbonItemEventArgs
```
```vb
Public Class TextBoxEnterPressedEventArgs
	Inherits RibbonItemEventArgs
```
```cpp
public ref class TextBoxEnterPressedEventArgs : public RibbonItemEventArgs
```
```fsharp
type TextBoxEnterPressedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
```

The TextBoxEnterPressedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TextBoxEnterPressedEventArgs | Initializes a new instance of the TextBoxEnterPressedEventArgs class |

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. (Inherited from RibbonItemEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace